[
  {
    "title": "LuggShare Website",
    "overview": "Developed a dynamic web application that facilitates luggage space sharing among air commuters. This innovative platform connects travelers with excess luggage capacity to those needing extra space, optimizing travel efficiency and reducing costs.",
    "image": "/plane.gif",
    "link": "https://project-one-link.com",
    "techStack": ["/js.png", "/React.png", "/mongo.webp", "/html.png", "/css.png"],
    "technologiesUsed": {
      "frontend": "React",
      "backend": "Node.js, Express",
      "database": "MongoDB (MongoDB Atlas)",
      "apis": ["Google Login", "Razorpay", "Aviationstack"],
      "hosting": ["Vercel (Frontend)", "Render (Backend)"]
    },
    "keyFeatures": [
      "Integrated Google Login for seamless and secure user authentication.",
      "Implemented Razorpay API for secure and convenient payment processing, enabling users to pay for luggage space directly through the platform.",
      "Utilized the Aviationstack API to provide real-time flight data, ensuring accurate information on flight schedules and availability.",
      "Built with React to ensure a responsive and user-friendly interface across all devices, enhancing user experience.",
      "Managed data using MongoDB Atlas, providing a robust, scalable, and cloud-based solution for storing user information, booking details, and transaction records.",
      "Developed an algorithm to match users needing extra luggage space with those offering it based on flight details, dates, and locations.",
      "Deployed the frontend on Vercel, ensuring fast and reliable delivery of the web application to users.",
      "Deployed the backend on Render, offering a scalable and robust environment for the server-side components."
    ],
    "challengesAndSolutions": [
      "Ensured smooth integration of multiple APIs (Google Login, Razorpay, Aviationstack) by thorough testing and handling potential edge cases to maintain data integrity and security.",
      "Designed the backend with scalability in mind, allowing the platform to handle a growing user base and increasing data loads without performance degradation."
    ],
    "conclusion": "This project exemplifies a comprehensive application of modern web development technologies to solve real-world problems. By leveraging the power of React, Node.js, Express, and MongoDB Atlas, combined with essential third-party APIs, the platform offers a seamless experience for air commuters looking to share luggage space, making air travel more economical and efficient. Hosting on Vercel and Render ensures reliable and scalable delivery of both the frontend and backend services."
  },
  {
    "title": "Project Two",
    "description": "This is a description for project two.",
    "image": "path/to/image2.jpg",
    "link": "https://project-two-link.com",
    "techStack": ["path/to/tech1.png", "path/to/tech2.png"]
  },
  {
    "title": "Project Three",
    "description": "This is a description for project one.",
    "image": "path/to/image1.jpg",
    "link": "https://project-one-link.com",
    "techStack": ["path/to/tech1.png", "path/to/tech2.png"]
  },
  {
    "title": "Project Four",
    "description": "This is a description for project one.",
    "image": "path/to/image1.jpg",
    "link": "https://project-one-link.com",
    "techStack": ["path/to/tech1.png", "path/to/tech2.png"]
  },
  {
    "title": "Project Five",
    "description": "This is a description for project one.",
    "image": "path/to/image1.jpg",
    "link": "https://project-one-link.com",
    "techStack": ["path/to/tech1.png", "path/to/tech2.png"]
  },
  {
    "title": "Project Six",
    "description": "This is a description for project one.",
    "image": "path/to/image1.jpg",
    "link": "https://project-one-link.com",
    "techStack": ["path/to/tech1.png", "path/to/tech2.png"]
  }
]
